gferreiratfmc/dpmu/dpmu_cpu1/dpmu_cpu1.syscfg
epwm8.$name                                                    = "GLOAD_4_3";
epwm8.epwmTimebase_emulationMode                               = "EPWM_EMULATION_FREE_RUN";
epwm8.epwmTimebase_hsClockDiv                                  = "EPWM_HSCLOCK_DIVIDER_1";
epwm8.epwmTimebase_period                                      = 10000;
epwm8.epwmTimebase_counterMode                                 = "EPWM_COUNTER_MODE_UP";
epwm8.epwmTimebase_syncInPulseSource                           = "EPWM_SYNC_IN_PULSE_SRC_DISABLE";
epwm8.epwmCounterCompare_cmpA                                  = 10001;
epwm8.epwmCounterCompare_cmpB                                  = 10001;
epwm8.epwmActionQualifier_EPWM_AQ_OUTPUT_A_ON_TIMEBASE_ZERO    = "EPWM_AQ_OUTPUT_HIGH";
epwm8.epwmActionQualifier_EPWM_AQ_OUTPUT_A_ON_TIMEBASE_UP_CMPA = "EPWM_AQ_OUTPUT_LOW";
epwm8.epwmActionQualifier_EPWM_AQ_OUTPUT_B_ON_TIMEBASE_ZERO    = "EPWM_AQ_OUTPUT_HIGH";
epwm8.epwmActionQualifier_EPWM_AQ_OUTPUT_B_ON_TIMEBASE_UP_CMPB = "EPWM_AQ_OUTPUT_LOW";
epwm8.epwm.$assign                                             = "EPWM9";
epwm8.epwm.epwmaPin.$assign                                    = "GPIO161";

gpio1.$name           = "CAN_A_ERR";
gpio1.masterCore      = "GPIO_CORE_CPU2";
gpio1.gpioPin.$assign = "GPIO6";

gpio2.$name           = "SPARE_B6";
gpio2.masterCore      = "GPIO_CORE_CPU2";
gpio2.gpioPin.$assign = "GPIO7";

gpio3.masterCore      = "GPIO_CORE_CPU2";
gpio3.$name           = "eFUSEVin";
gpio3.gpioPin.$assign = "GPIO8";

gpio4.$name           = "CAN_B_ERR";
gpio4.gpioPin.$assign = "GPIO18";

gpio5.$name           = "HC_24V_EN";
gpio5.masterCore      = "GPIO_CORE_CPU2";
gpio5.gpioPin.$assign = "GPIO25";

gpio6.$name           = "ENABLE_24V";
gpio6.masterCore      = "GPIO_CORE_CPU2";
gpio6.gpioPin.$assign = "GPIO84";

gpio7.$name           = "GCMD0";
gpio7.direction       = "GPIO_DIR_MODE_OUT";
gpio7.masterCore      = "GPIO_CORE_CPU2";
gpio7.gpioPin.$assign = "GPIO97";

gpio8.$name           = "GCMD1";
gpio8.direction       = "GPIO_DIR_MODE_OUT";
gpio8.masterCore      = "GPIO_CORE_CPU2";
gpio8.gpioPin.$assign = "GPIO124";

gpio9.$name           = "GCMD2";
gpio9.direction       = "GPIO_DIR_MODE_OUT";
gpio9.masterCore      = "GPIO_CORE_CPU2";
gpio9.gpioPin.$assign = "GPIO128";

gpio10.$name           = "GCMD3";
gpio10.direction       = "GPIO_DIR_MODE_OUT";
gpio10.masterCore      = "GPIO_CORE_CPU2";
gpio10.gpioPin.$assign = "GPIO137";

gpio11.$name           = "GCMD4";
gpio11.direction       = "GPIO_DIR_MODE_OUT";
gpio11.masterCore      = "GPIO_CORE_CPU2";
gpio11.gpioPin.$assign = "GPIO138";

gpio12.$name           = "GCMD5";
gpio12.direction       = "GPIO_DIR_MODE_OUT";
gpio12.masterCore      = "GPIO_CORE_CPU2";
gpio12.gpioPin.$assign = "GPIO139";

gpio13.$name           = "GCMD6";
gpio13.direction       = "GPIO_DIR_MODE_OUT";
gpio13.masterCore      = "GPIO_CORE_CPU2";
gpio13.gpioPin.$assign = "GPIO140";

gpio14.$name             = "GCMD7";
gpio14.direction         = "GPIO_DIR_MODE_OUT";
gpio14.writeInitialValue = true;
gpio14.initialValue      = 1;
gpio14.masterCore        = "GPIO_CORE_CPU2";
gpio14.gpioPin.$assign   = "GPIO142";

gpio15.$name           = "SPARE_H1";
gpio15.masterCore      = "GPIO_CORE_CPU2";
gpio15.gpioPin.$assign = "GPIO100";

gpio16.$name           = "GLOAD_2";
gpio16.direction       = "GPIO_DIR_MODE_OUT";
gpio16.masterCore      = "GPIO_CORE_CPU2";
gpio16.gpioPin.$assign = "GPIO167";

gpio17.$name             = "N_OE_POL";
gpio17.direction         = "GPIO_DIR_MODE_OUT";
gpio17.writeInitialValue = true;
gpio17.initialValue      = 1;
gpio17.masterCore        = "GPIO_CORE_CPU2";
gpio17.gpioPin.$assign   = "GPIO132";

gpio18.$name           = "N_LE_POL_0";
gpio18.direction       = "GPIO_DIR_MODE_OUT";
gpio18.masterCore      = "GPIO_CORE_CPU2";
gpio18.gpioPin.$assign = "GPIO133";

gpio19.$name           = "N_LE_POL_1";
gpio19.direction       = "GPIO_DIR_MODE_OUT";
gpio19.masterCore      = "GPIO_CORE_CPU2";
gpio19.gpioPin.$assign = "GPIO134";

gpio20.$name           = "Testpin";
gpio20.direction       = "GPIO_DIR_MODE_OUT";
gpio20.masterCore      = "GPIO_CORE_CPU2";
gpio20.gpioPin.$assign = "GPIO9";

gpio21.$name           = "TEST_SYNC";
gpio21.gpioPin.$assign = "GPIO141";

gpio22.$name           = "GLOAD_1";
gpio22.direction       = "GPIO_DIR_MODE_OUT";
gpio22.masterCore      = "GPIO_CORE_CPU2";
gpio22.gpioPin.$assign = "GPIO163";

gpio23.$name           = "eFuseBB";
gpio23.padConfig       = "PULLUP";
gpio23.qualMode        = "GPIO_QUAL_ASYNC";
gpio23.masterCore      = "GPIO_CORE_CPU2";
gpio23.useInterrupt    = true;
gpio23.gpioPin.$assign = "GPIO166";
gpio23.xint.enableInt  = true;

gpio24.$name           = "GCMD8";
gpio24.direction       = "GPIO_DIR_MODE_OUT";
gpio24.masterCore      = "GPIO_CORE_CPU2";
gpio24.gpioPin.$assign = "GPIO146";

i2c1.bitCount               = "I2C_BITCOUNT_8";
i2c1.$name                  = "I2C_BUS";
i2c1.useInterrupts          = false;
i2c1.bitRate                = 50000;
i2c1.i2c.$assign            = "I2CA";
i2c1.i2c.i2c_sdaPin.$assign = "GPIO0";
i2c1.i2c.i2c_sclPin.$assign = "GPIO1";

i2c2.$name                  = "I2C_BUS_B";
i2c2.useInterrupts          = false;
i2c2.bitCount               = "I2C_BITCOUNT_8";
i2c2.i2c.$assign            = "I2CB";
i2c2.i2c.i2c_sdaPin.$assign = "GPIO2";
i2c2.i2c.i2c_sclPin.$assign = "GPIO3";

inputxbar_input1.$name         = "Trip1";
inputxbar_input1.inputxbarGpio = "GPIO8";
inputxbar_input1.inputxbarLock = true;

inputxbar_input2.$name          = "Trip2";
inputxbar_input2.inputxbarInput = "XBAR_INPUT2";
inputxbar_input2.inputxbarGpio  = "GPIO2";

inputxbar_input3.$name         = "Trip3";
inputxbar_input3.inputxbarGpio = "GPIO166";
gpio23.xint.inputxbar          = inputxbar_input3;

memcfg.config_MEMCFG_SECT_GS1 = "MEMCFG_GSRAMMASTER_CPU2";
memcfg.config_MEMCFG_SECT_GS3 = "MEMCFG_GSRAMMASTER_CPU2";

sci1.useFifo                  = false;
sci1.registerInterrupts       = true;
sci1.enabledInterrupts        = ["SCI_INT_RXRDY_BRKDT"];
sci1.enabledErrorInterrupts   = ["SCI_INT_FE","SCI_INT_OE","SCI_INT_PE","SCI_INT_RXERR"];
sci1.$name                    = "cli_serial";
sci1.sci.$assign              = "SCIA";
sci1.sci.sci_rxPin.$assign    = "GPIO43";
sci1.sci.sci_txPin.$assign    = "GPIO42";
sci1.sciRXInt.enableInterrupt = true;
sci1.sciTXInt.enableInterrupt = true;

sysctl.cpuSel_ADCA                = "SYSCTL_CPUSEL_CPU2";
sysctl.cpuSel_ADCB                = "SYSCTL_CPUSEL_CPU2";
sysctl.cpuSel_ADCC                = "SYSCTL_CPUSEL_CPU2";
sysctl.cpuSel_ADCD                = "SYSCTL_CPUSEL_CPU2";
sysctl.cpuSel_EPWM1               = "SYSCTL_CPUSEL_CPU2";
sysctl.cpuSel_EPWM2               = "SYSCTL_CPUSEL_CPU2";
sysctl.cpuSel_EPWM3               = "SYSCTL_CPUSEL_CPU2";
sysctl.cpuSel_EPWM4               = "SYSCTL_CPUSEL_CPU2";
sysctl.cpuSel_EPWM5               = "SYSCTL_CPUSEL_CPU2";
sysctl.cpuSel_EPWM6               = "SYSCTL_CPUSEL_CPU2";
sysctl.cpuSel_EPWM7               = "SYSCTL_CPUSEL_CPU2";
sysctl.cpuSel_EPWM8               = "SYSCTL_CPUSEL_CPU2";
sysctl.cpuSel_EPWM11              = "SYSCTL_CPUSEL_CPU2";
sysctl.cpuSel_EPWM12              = "SYSCTL_CPUSEL_CPU2";
sysctl.cpuSel_EPWM16              = "SYSCTL_CPUSEL_CPU2";
sysctl.cpuSel_EPWM9               = "SYSCTL_CPUSEL_CPU2";
sysctl.cpuSel_EPWM15              = "SYSCTL_CPUSEL_CPU2";
sysctl.cpuSel_EPWM14              = "SYSCTL_CPUSEL_CPU2";
sysctl.cpuSel_EPWM13              = "SYSCTL_CPUSEL_CPU2";
sysctl.cpuSel_EPWM10              = "SYSCTL_CPUSEL_CPU2";
sysctl.standbyQualificationPeriod = 2;

/**
 * Pinmux solution for unlocked pins/peripherals. This ensures that minor changes to the automatic solver in a future
 * version of the tool will not impact the pinmux you originally saw.  These lines can be completely deleted in order to
 * re-solve from scratch.
 */
epwm5.epwm.$suggestSolution          = "EPWM3";
epwm7.epwm.epwmaPin.$suggestSolution = "GPIO143";
epwm7.epwm.epwmbPin.$suggestSolution = "GPIO144";
epwm8.epwm.epwmbPin.$suggestSolution = "GPIO162";
